Oh, this seems to be related to or even a duplicate of #464 although I do not see how this is related to the owners:

~~~
data "azuread_client_config" "current" {}

resource "azuread_group" "foo" {
  display_name = "foo"
}

resource "azuread_group" "foo_with_owners_current_caller" {
  display_name = "foo_with_owners_current_caller"
  owners       = [data.azuread_client_config.current.object_id]
}

resource "azuread_group" "foo_with_different_owner" {
  display_name = "foo_with_different_owner"
  owners       = ["31812e0a-0cfd-4d42-a6d5-99076f0cf2f7"] # different from data.azuread_client_config.current.object_id
}
~~~

~~~
$ terraform apply
azuread_group.bar: Refreshing state... [id=a8341fce-6014-431a-a54b-b1ad0e9bf9ec]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_group.foo will be created
  + resource "azuread_group" "foo" {
      + display_name            = "foo"
      + id                      = (known after apply)
      + mail_enabled            = (known after apply)
      + members                 = (known after apply)
      + name                    = (known after apply)
      + object_id               = (known after apply)
      + owners                  = (known after apply)
      + prevent_duplicate_names = false
      + security_enabled        = (known after apply)
    }

  # azuread_group.foo_with_different_owner will be created
  + resource "azuread_group" "foo_with_different_owner" {
      + display_name            = "foo_with_different_owner"
      + id                      = (known after apply)
      + mail_enabled            = (known after apply)
      + members                 = (known after apply)
      + name                    = (known after apply)
      + object_id               = (known after apply)
      + owners                  = [
          + "31812e0a-0cfd-4d42-a6d5-99076f0cf2f7",
        ]
      + prevent_duplicate_names = false
      + security_enabled        = (known after apply)
    }

  # azuread_group.foo_with_owners_current_caller will be created
  + resource "azuread_group" "foo_with_owners_current_caller" {
      + display_name            = "foo_with_owners_current_caller"
      + id                      = (known after apply)
      + mail_enabled            = (known after apply)
      + members                 = (known after apply)
      + name                    = (known after apply)
      + object_id               = (known after apply)
      + owners                  = [
          + "06ee5fa0-7a61-4313-bae7-4d1bf50cbb03",
        ]
      + prevent_duplicate_names = false
      + security_enabled        = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

azuread_group.foo_with_different_owner: Creating...
azuread_group.foo_with_owners_current_caller: Creating...
azuread_group.foo: Creating...
╷
│ Error: Creating group "foo"
│ 
│   with azuread_group.foo,
│   on main.tf line 25, in resource "azuread_group" "foo":
│   25: resource "azuread_group" "foo" {
│ 
│ GroupsClient.BaseClient.Post(): unexpected status 400 with OData error: Request_BadRequest: Request contains a property with duplicate values.
╵
╷
│ Error: Creating group "foo_with_owners_current_caller"
│ 
│   with azuread_group.foo_with_owners_current_caller,
│   on main.tf line 35, in resource "azuread_group" "foo_with_owners_current_caller":
│   35: resource "azuread_group" "foo_with_owners_current_caller" {
│ 
│ GroupsClient.BaseClient.Post(): unexpected status 400 with OData error: Request_BadRequest: Request contains a property with duplicate values.
╵
╷
│ Error: Creating group "foo_with_different_owner"
│ 
│   with azuread_group.foo_with_different_owner,
│   on main.tf line 40, in resource "azuread_group" "foo_with_different_owner":
│   40: resource "azuread_group" "foo_with_different_owner" {
│ 
│ GroupsClient.BaseClient.Post(): unexpected status 400 with OData error: Request_BadRequest: Request contains a property with duplicate values.
╵
~~~